import React from "react";
import { Link } from "react-router-dom";
import Image1 from "../images/about/bg1.jpg";
import Image2 from "../images/about/bg2.jpg";
import Image3 from "../images/about/bg3.jpg";
// import More1 from "./more1";
// import More2 from "./more2";
// import More3 from "./more3";

class About extends React.Component {
  render() {
    return (
      <section>
        <div className="main__logo">
          <div className="container">
            <div className="parallax__1" />
            <div className="container__fill__1">
              <div className="about__container">
                <div className="about__1">
                  <img
                    src={Image1}
                    alt=""
                  />
                  {/* <More1 /> */}
                  <p>
                    Ми в <span>#ED_SPACE</span> створили спеціальний курс
                    практичної англійської мови для дітей віком від 4-х років. У
                    нас немає парт і стільців до яких всі звикли у звичайних
                    школах. Заняття ведуться в форматі <span>open space</span>.
                    Ніякого авторитарного режиму від вчителя. Вчитель і учень
                    завжди знаходяться на одному рівні, відкритому для вільної
                    комунікації.
                    <br />
                    Один з наших принципів “-Голодний студент не може бути
                    продуктивним”. Саме тому ми маємо для наших студентів чай,
                    печиво, каву і цукерки, щоб ніхто не лишався голодним і
                    працював в комфортній атмосфері за чашечкою улюбленого
                    напою.
                    <br />
                    Наш старший викладач - один з найкращих викладачів України.
                    Сертифікований тренер Європейської організації{" "}
                    <span>“TWINNING”</span>, яка займається підвищенням
                    кваліфікації викладачів по всії Європі. А хто може бути
                    кращим за того, хто вчить викладачів - викладати?
                    <br />
                    Ви можете спробувати наш формат просто записавшись на
                    безкоштовне пробне заняття для себе або для своєї дититни.
                    Телефонуйте або пишіть нам і домовимось на зручний для вас
                    час для відвідування нашого безкоштовного заняття.
                  </p>
                </div>
                <div className="about__2">
                  <img
                    src={Image2}
                    alt=""
                  />
                  {/* <More2 /> */}
                  <p>
                    «Щоб бути розумним треба прочитати одну книгу. Щоб знайти її
                    - потрібні тисячі» - так каже одна мудрість. Це саме
                    стосується і книжок з англійської. Але вам не треба
                    опрацьовувати 1000 книжок. Ми зробили це замість вас. Ми
                    багато уваги приділяємо як комфорту так і потребам наших
                    учнів тому відмовляємось від програм по книжкам які треба
                    встигнути зробити. Наша програма адаптується і
                    достосовується під кожного з учнів.
                    <br />
                    <br />
                    Наші викладачі відібрали найкращі матеріали з вже існючих
                    книг. Пропустили неважливе, та закцентували увагу на
                    потрібному. Жодної непотрібної вправи. Лише якісний
                    «контент». Більше ніякого
                    <span>«London is the capital of Great Britain»</span>! Все
                    це для того, щоб зробити навчання для вас легшим та
                    цікавішим!
                  </p>
                </div>
                <div className="about__3">
                  <img
                    src={Image3}
                    alt=""
                  />
                  {/* <More3 /> */}
                  <p>
                    Ми знаємо, що вам, як батькам, дуже важливо розуміти як
                    справи у вашої самостійної дитини. Які в неї успіхи у
                    навчанні, з ким спілкується, що взагалі робить у школі чи на
                    додаткових курсах? Саме тому, щоб ви мали повне розуміння
                    того, чим зайнята ваша дитина у нас - ми будемо систематично
                    надавати інформацію щодо успіхів у навчанні, про теми на які
                    спілкується, з яким настроєм приходить до нас, з якими
                    труднощами зтикається в навчанні, що дається легко та багато
                    іншого.
                    <br />
                    <br />
                    <span>Регулярний зворотній зв’язок</span> - важко
                    переоцінити, аби мати розуміння своїх успіхів для
                    ефективного навчання. Ви будете розуміти, на що ми робимо
                    акценти при роботі з вашою дитиною. Таким чином, ви постійно
                    залучені до процесу освіти дитини, матимете розуміння
                    прогресу у навчанні та її емоційного стану.
                  </p>
                </div>
              </div>
            </div>
          </div>
        </div>
        <footer>
          <p>&copy; #ED_SPACE 2018</p>
          <p>+380-(00)-000-00-00</p>
          <p>вул. Богдана Хмельницького 9. м. Біла Церква</p>
          <Link to="/contact" className="instagram" />
          <Link to="/contact" className="facebook" />
        </footer>
      </section>
    );
  }
}

export default About;
