import React, { Component } from "react";

import ShowMoreText from "react-show-more-text";

// ...

class More1 extends Component {
  executeOnClick(isExpanded) {
    console.log(isExpanded);
  }

  render() {
    return (
      <ShowMoreText
        lines={2}
        more="Show more"
        less="Show less"
        anchorClass=""
        onClick={this.executeOnClick}
      >
        <p>
          Ми в <span>#ED_SPACE</span> створили спеціальний курс практичної
          англійської мови для дітей віком від 4-х років. У нас немає парт і
          стільців до яких всі звикли у звичайних школах. Заняття ведуться в
          форматі <span>open space</span>. Ніякого авторитарного режиму від
          вчителя. Вчитель і учень завжди знаходяться на одному рівні,
          відкритому для вільної комунікації.
          <br />
          Один з наших принципів “-Голодний студент не може бути продуктивним”.
          Саме тому ми маємо для наших студентів чай, печиво, каву і цукерки,
          щоб ніхто не лишався голодним і працював в комфортній атмосфері за
          чашечкою улюбленого напою.
          <br />
          Наш старший викладач - один з найкращих викладачів України.
          Сертифікований тренер Європейської організації <span>“TWINNING”</span>
          , яка займається підвищенням кваліфікації викладачів по всії Європі. А
          хто може бути кращим за того, хто вчить викладачів - викладати?
          <br />
          Ви можете спробувати наш формат просто записавшись на безкоштовне
          пробне заняття для себе або для своєї дититни. Телефонуйте або пишіть
          нам і домовимось на зручний для вас час для відвідування нашого
          безкоштовного заняття.
        </p>
      </ShowMoreText>
    );
  }
}

export default More1;
