import React from "react";

import ShowMoreText from "react-show-more-text";

// ...

class More1 extends React.Component {
  executeOnClick(isExpanded) {
    console.log(isExpanded);
  }

  render() {
    return (
      <ShowMoreText
        lines={4}
        more="Показати більше"
        less="Звернути"
        anchorClass=""
        onClick={this.executeOnClick}
      >
        <p>
          Ми в #ED_SPACE створили спеціальний курс практичної англійської мови
          для дітей віком від 4-х років. У нас немає парт і стільців до яких всі
          звикли у звичайних школах. Заняття ведуться в форматі open space.
          Ніякого авторитарного режиму від вчителя. Вчитель і учень завжди
          знаходяться на одному рівні, відкритому для вільної комунікації.
          <br />
          <br />
          Один з наших принципів “-Голодний студент не може бути продуктивним”.
          Саме тому ми маємо для наших студентів чай, печиво, каву і цукерки,
          щоб ніхто не лишався голодним і працював в комфортній атмосфері за
          чашечкою улюбленого напою.
          <br />
          Наш старший викладач - один з найкращих викладачів України.
          Сертифікований тренер Європейської організації “TWINNING”, яка
          займається підвищенням кваліфікації викладачів по всії Європі. А хто
          може бути кращим за того, хто вчить викладачів - викладати?
        </p>
      </ShowMoreText>
    );
  }
}

export default More1;
